Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиОтчет();
    ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Наименование = НСтр("ru = 'Выпуск услуг в плановых ценах (внешний отчет)'");
	ПараметрыРегистрации.Информация = "";
	
	
	
    Возврат ПараметрыРегистрации;	

КонецФункции // СведенияОВнешнейОбработке()
 