
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Назначение.Добавить("Документ.ПриемНаРаботу");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Трудовой договор (ВПФ)'");
	Команда.Идентификатор = "MXL_ПФ_ТрудовойДоговор";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Ложь;
	Команда.Модификатор = "ПечатьMXL";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "MXL_ПФ_ТрудовойДоговор");
	
	
	Если ПечатнаяФорма <> Неопределено Тогда
	
		ПечатнаяФорма.ТабличныйДокумент = СформироватьТрудовойДоговор(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru='Трудовой договор (ВПФ)'");
	
	КонецЕсли; 
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  МассивОбъектов	 - 	 - 
//  ОбъектыПечати	 - 	 - 
// 
// Возвращаемое значение:
//   - <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СформироватьТрудовойДоговор(МассивОбъектов, ОбъектыПечати)

	ТабДок = Новый ТабличныйДокумент;
	
	Возврат ТабДок;

КонецФункции // СформироватьТрудовойДоговор()
 
